# εκτύπωση του τρέχοντος καταλόγου
# πατήστε στην γραμμή και μετά Ctrl+Enter για εκτέλεση
getwd()

# αλλαγή σε ένα επιθυμητό directory π.χ. στο "/home/leonidas/Desktop"
# ορίστε το directory που θέλετε
setwd("/home/leonidas/Desktop")


# μερικές πράξεις σαν παράδειγμα ορισμού μεταβλητών και εκφράσεων με τελεστες
# ορισμός δύο αριθμητικών μεταβλητων
varos <- 90
varos2 <- 2

# πράξεις μεταξύ δύο μεταβλητών
metaboli_varos <- varos+varos2

# Εκτύπωση του αποτελέσματος
print(metaboli_varos)

# ορισμός μεταβλητής συμβολοσειράς 
name <- "Leonidas"
print(name) # Εκτύπωση του αποτελέσματος

# Δειγματοληψία

# για σκοπούς αναπαραγωγής ορίζουμε το set.seed για ψευδοτυχαία επιλογή αριθμών
set.seed(123)

# δημιουργία ενος vector με αριθμούς 
# τα vector είναι δομή δεδομένων που περιλαμβάνει πολλά στοιχεία από τον ίδιο τύπο δεδομένων π.χ. μόνο ακέραιους 
vector <-c(500:700)

# τυχαία δειγματοληψία 11 στοιχεία από το πληθυσμό του vector 
deigma <- sample(vector, 11)

# Μέτρα περιγραφικής στατιστικής και εφαρμογή συναρτήσεων
# μπορείτε να δειτε το manual κάθε συνάρτησης με την πρόθεσε ενός ? πριν την συνάρτηση π.χ. ?sd

mean(deigma) # μέσος όρος
min(deigma) # ελάχιστη τιμή
max(deigma) # μέγιστη τιμή
var(deigma) # διακύμανση 
sd(deigma) # τυπική διακύμανση αλλιώς μπορεί να υπολογιστει και ως sqrt(var(deigma))
sum(deigma) # άθροισμα
length(deigma) # πλήθος παρατηρήσεων. ισοδυναμεί με το μήκος του διανύσματος


